noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_229 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_229 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_230 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_230 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_231 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_231 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_77 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_153 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_77 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_154 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_77 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_232 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_232 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_233 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_233 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_234 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_234 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_78 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_155 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_78 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_156 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_78 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
