noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_193 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_193 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_194 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_194 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_195 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_195 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_65 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_129 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_65 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_130 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_65 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_196 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_196 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_197 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_197 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_198 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_198 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_66 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_131 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_66 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_132 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_66 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
