noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_67 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_67 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_68 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_68 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_69 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_23 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_45 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_23 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_46 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_23 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_70 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_70 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_71 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_72 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_24 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_47 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_24 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_24 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
