noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_319 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_319 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_320 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_320 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_321 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_321 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_107 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_213 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_107 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_214 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_107 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_322 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_322 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_323 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_323 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_324 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_324 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_108 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_215 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_108 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_216 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_108 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
