noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_175 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_175 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_176 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_176 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_177 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_177 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_59 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_117 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_59 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_118 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_59 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_178 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_178 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_179 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_179 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_180 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_180 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_60 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_119 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_60 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_120 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_60 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
