noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_343 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_343 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_344 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_344 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_345 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_345 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_115 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_229 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_115 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_230 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_115 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_346 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_346 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_347 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_347 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_348 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_348 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_116 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_231 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_116 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_232 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_116 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
