noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_259 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_259 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_260 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_260 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_261 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_261 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_87 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_173 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_87 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_174 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_87 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_262 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_262 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_263 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_263 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_264 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_264 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_88 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_175 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_88 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_176 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_88 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
