noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_91 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_91 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_92 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_92 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_93 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_93 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_31 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_61 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_31 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_62 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_31 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_94 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_94 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_95 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_95 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_96 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_96 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_32 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_63 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_32 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_64 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_32 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
