noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_361 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_361 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_362 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_362 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_363 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_363 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_121 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_241 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_121 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_242 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_121 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_364 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_364 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_365 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_365 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_366 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_366 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_122 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_243 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_122 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_244 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_122 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
