noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_403 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_403 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_404 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_404 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_405 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_405 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_135 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_269 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_135 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_270 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_135 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_406 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_406 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_407 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_407 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_408 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_408 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_136 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_271 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_136 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_272 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_136 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
