**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_148 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_148 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_149 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_149 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_150 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_150 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_50 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_99 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_50 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_100 (Dense)            (None, 1)                 257       
_________________________________________________________________
activation_50 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_148 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_148 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_149 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_149 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_150 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_150 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_50 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_99 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_50 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_100 (Dense)            (None, 1)                 257       
_________________________________________________________________
activation_50 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_148 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_148 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_149 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_149 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_150 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_150 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_50 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_99 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_50 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_100 (Dense)            (None, 1)                 257       
_________________________________________________________________
activation_50 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
