noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_331 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_331 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_332 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_332 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_333 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_333 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_111 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_221 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_111 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_222 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_111 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_334 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_334 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_335 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_335 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_336 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_336 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_112 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_223 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_112 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_224 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_112 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
