noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_337 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_337 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_338 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_338 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_339 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_339 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_113 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_225 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_113 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_226 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_113 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_340 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_340 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_341 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_341 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_342 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_342 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_114 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_227 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_114 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_228 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_114 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
