noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_253 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_253 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_254 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_254 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_255 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_255 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_85 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_169 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_85 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_170 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_85 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_256 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_256 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_257 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_257 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_258 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_258 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_86 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_171 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_86 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_172 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_86 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
