noise level: 0.8
clean data size for each class: 50
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_76 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_76 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_77 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_78 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_26 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_26 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_79 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_79 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_80 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_81 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_81 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_27 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_53 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_27 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_27 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_94 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_94 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_95 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_95 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_96 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_96 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_32 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_63 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_32 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_64 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_32 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
