noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_289 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_289 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_290 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_290 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_291 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_291 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_97 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_193 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_97 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_194 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_97 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_292 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_292 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_293 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_293 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_294 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_294 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_98 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_195 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_98 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_196 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_98 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
