noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_373 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_373 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_374 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_374 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_375 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_375 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_125 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_249 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_125 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_250 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_125 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_376 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_376 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_377 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_377 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_378 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_378 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_126 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_251 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_126 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_252 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_126 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
