noise level: 0.8
clean data size for each class: 50
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_124 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_124 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_125 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_125 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_126 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_126 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_83 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_42 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_84 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_42 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_127 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_127 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_128 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_128 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_129 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_129 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_43 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_85 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_43 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_86 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_43 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_142 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_142 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_143 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_143 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_144 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_144 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_48 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_95 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_48 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_96 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_48 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
