noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_79 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_79 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_80 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_81 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_81 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_27 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_53 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_27 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_27 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_82 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_82 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_83 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_83 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_84 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_84 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_28 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_55 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_28 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_56 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_28 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
