noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_415 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_415 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_416 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_416 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_417 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_417 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_139 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_277 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_139 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_278 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_139 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_418 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_418 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_419 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_419 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_420 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_420 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_140 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_279 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_140 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_280 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_140 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
