noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_247 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_247 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_248 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_248 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_249 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_249 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_83 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_165 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_83 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_166 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_83 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_250 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_250 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_251 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_251 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_252 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_252 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_84 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_167 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_84 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_168 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_84 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
