noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_163 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_163 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_164 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_164 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_165 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_165 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_55 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_109 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_55 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_110 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_55 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_166 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_166 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_167 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_167 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_168 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_168 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_56 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_111 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_56 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_112 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_56 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
