noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_355 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_355 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_356 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_356 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_357 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_357 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_119 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_237 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_119 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_238 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_119 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_358 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_358 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_359 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_359 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_360 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_360 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_120 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_239 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_120 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_240 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_120 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
