noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_55 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_55 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_56 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_57 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_37 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_19 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_38 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_19 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_58 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_58 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_59 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_60 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_20 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_20 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
