noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_379 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_379 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_380 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_380 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_381 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_381 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_127 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_253 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_127 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_254 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_127 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_382 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_382 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_383 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_383 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_384 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_384 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_128 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_255 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_128 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_256 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_128 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
