noise level: 0.5
clean data size for each class: 50
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_220 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_220 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_221 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_221 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_222 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_222 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_74 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_147 (Dense)            (None, 256)               131328    
_________________________________________________________________
dropout_74 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_148 (Dense)            (None, 1)                 257       
_________________________________________________________________
activation_74 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_223 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_223 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_224 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_224 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_225 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_225 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_75 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_149 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_75 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_150 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_75 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_238 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_238 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_239 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_239 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_240 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_240 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_80 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_159 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_80 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_160 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_80 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
