noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_283 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_283 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_284 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_284 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_285 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_285 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_95 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_189 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_95 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_190 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_95 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_286 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_286 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_287 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_287 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_288 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_288 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_96 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_191 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_96 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_192 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_96 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
