noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_211 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_211 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_212 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_212 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_213 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_213 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_71 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_141 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_71 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_142 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_71 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_214 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_214 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_215 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_215 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_216 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_216 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_72 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_143 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_72 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_144 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_72 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
