**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_118 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_118 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_119 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_120 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_120 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_79 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_40 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_80 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_40 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_118 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_118 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_119 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_120 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_120 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_79 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_40 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_80 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_40 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
