noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_307 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_307 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_308 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_308 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_309 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_309 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_103 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_205 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_103 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_206 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_103 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_310 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_310 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_311 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_311 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_312 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_312 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_104 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_207 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_104 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_208 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_104 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
