noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_397 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_397 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_398 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_398 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_399 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_399 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_133 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_265 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_133 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_266 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_133 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_400 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_400 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_401 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_401 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_402 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_402 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_134 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_267 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_134 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_268 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_134 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
