noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_367 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_367 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_368 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_368 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_369 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_369 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_123 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_245 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_123 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_246 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_123 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_370 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_370 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_371 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_371 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_372 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_372 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_124 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_247 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_124 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_248 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_124 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
