noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_199 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_199 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_200 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_200 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_201 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_201 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_67 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_133 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_67 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_134 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_67 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_202 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_202 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_203 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_203 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_204 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_204 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_68 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_135 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_68 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_136 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_68 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
