noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_181 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_181 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_182 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_182 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_183 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_183 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_61 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_121 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_61 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_122 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_61 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_184 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_184 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_185 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_185 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_186 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_186 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_62 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_123 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_62 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_124 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_62 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
