noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_409 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_409 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_410 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_410 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_411 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_411 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_137 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_273 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_137 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_274 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_137 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_412 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_412 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_413 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_413 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_414 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_414 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_138 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_275 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_138 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_276 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_138 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
