noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_349 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_349 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_350 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_350 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_351 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_351 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_117 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_233 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_117 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_234 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_117 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_352 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_352 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_353 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_353 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_354 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_354 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_118 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_235 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_118 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_236 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_118 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
