noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_97 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_97 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_98 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_98 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_99 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_99 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_33 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_65 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_33 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_66 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_33 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_100 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_100 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_101 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_101 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_102 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_102 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_34 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_67 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_34 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_68 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_34 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
