noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_115 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_115 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_116 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_116 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_117 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_117 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_39 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_77 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_39 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_78 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_39 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_118 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_118 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_119 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_120 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_120 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_79 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_40 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_80 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_40 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
