noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_265 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_265 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_266 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_266 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_267 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_267 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_89 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_177 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_89 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_178 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_89 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_268 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_268 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_269 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_269 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_270 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_270 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_90 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_179 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_90 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_180 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_90 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
