noise level: 0.5
clean data size for each class: 50
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_28 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_10 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_10 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
