noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_49 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_49 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_50 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_51 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_17 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_34 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_17 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_52 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_52 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_53 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_54 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_35 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_18 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_36 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_18 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
