noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_205 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_205 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_206 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_206 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_207 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_207 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_69 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_137 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_69 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_138 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_69 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_208 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_208 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_209 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_209 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_210 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_210 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_70 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_139 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_70 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_140 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_70 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
