noise level: 0.5
clean data size for each class: 50
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_172 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_172 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_173 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_173 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_174 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_174 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_58 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_115 (Dense)            (None, 256)               131328    
_________________________________________________________________
dropout_58 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_116 (Dense)            (None, 1)                 257       
_________________________________________________________________
activation_58 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_175 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_175 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_176 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_176 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_177 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_177 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_59 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_117 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_59 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_118 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_59 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_190 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_190 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_191 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_191 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_192 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_192 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_64 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_127 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_64 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_128 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_64 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
