noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_37 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_25 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_13 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_26 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_13 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_40 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_14 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_28 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_14 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
