noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_277 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_277 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_278 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_278 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_279 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_279 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_93 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_185 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_93 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_186 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_93 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_280 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_280 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_281 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_281 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_282 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_282 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_94 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_187 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_94 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_188 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_94 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
