noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_271 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_271 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_272 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_272 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_273 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_273 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_91 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_181 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_91 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_182 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_91 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_274 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_274 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_275 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_275 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_276 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_276 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_92 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_183 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_92 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_184 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_92 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
