noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_103 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_103 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_104 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_104 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_105 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_105 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_35 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_69 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_35 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_70 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_35 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_106 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_106 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_107 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_107 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_108 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_108 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_36 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_71 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_36 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_72 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_36 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
