noise level: 0.8
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_139 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_139 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_140 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_140 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_141 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_141 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_47 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_93 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_47 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_94 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_47 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_142 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_142 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_143 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_143 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_144 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_144 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_48 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_95 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_48 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_96 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_48 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
