noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_223 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_223 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_224 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_224 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_225 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_225 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_75 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_149 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_75 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_150 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_75 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_226 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_226 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_227 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_227 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_228 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_228 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_76 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_151 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_76 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_152 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_76 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
