noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_391 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_391 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_392 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_392 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_393 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_393 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_131 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_261 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_131 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_262 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_131 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_394 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_394 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_395 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_395 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_396 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_396 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_132 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_263 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_132 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_264 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_132 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
