noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_169 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_169 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_170 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_170 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_171 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_171 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_57 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_113 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_57 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_114 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_57 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_172 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_172 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_173 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_173 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_174 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_174 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_58 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_115 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_58 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_116 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_58 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
