**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_58 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_58 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_59 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_60 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_20 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_20 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_58 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_58 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_59 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_60 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_20 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_20 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_58 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_58 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_59 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_60 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_20 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_20 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
