noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_109 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_109 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_110 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_110 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_111 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_111 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_37 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_73 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_37 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_74 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_37 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_112 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_112 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_113 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_113 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_114 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_114 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_75 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_38 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_76 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_38 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
