noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_73 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_73 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_74 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_75 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_25 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_49 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_25 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_50 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_25 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_76 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_76 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_77 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_78 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_26 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_26 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
