noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_241 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_241 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_242 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_242 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_243 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_243 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_81 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_161 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_81 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_162 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_81 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_244 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_244 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_245 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_245 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_246 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_246 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_82 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_163 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_82 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_164 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_82 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
