noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_157 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_157 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_158 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_158 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_159 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_159 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_53 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_105 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_53 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_106 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_53 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_160 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_160 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_161 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_161 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_162 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_162 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_54 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_107 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_54 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_108 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_54 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
