noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_121 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_121 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_122 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_122 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_123 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_123 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_41 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_81 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_41 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_82 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_41 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_124 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_124 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_125 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_125 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_126 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_126 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_83 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_42 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_84 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_42 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
