noise level: 0.5
clean data size for each class: 50
**********architecture of binary classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_28 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_10 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_10 (Activation)   (None, 1)                 0         
=================================================================
Total params: 185,281
Trainable params: 185,281
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_31 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_21 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_11 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_11 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_46 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_46 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_47 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_48 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_16 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_32 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_16 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
