noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_217 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_217 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_218 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_218 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_219 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_219 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_73 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_145 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_73 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_146 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_73 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_220 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_220 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_221 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_221 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_222 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_222 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_74 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_147 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_74 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_148 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_74 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
