noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_61 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_61 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_62 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_63 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_41 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_21 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_42 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_21 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_64 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_64 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_65 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_66 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_22 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_43 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_22 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_44 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_22 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
