noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_313 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_313 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_314 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_314 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_315 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_315 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_105 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_209 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_105 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_210 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_105 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_316 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_316 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_317 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_317 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_318 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_318 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_106 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_211 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_106 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_212 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_106 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
