noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_151 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_151 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_152 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_152 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_153 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_153 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_51 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_101 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_51 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_102 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_51 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_154 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_154 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_155 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_155 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_156 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_156 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_52 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_103 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_52 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_104 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_52 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
