noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_325 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_325 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_326 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_326 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_327 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_327 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_109 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_217 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_109 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_218 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_109 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_328 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_328 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_329 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_329 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_330 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_330 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_110 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_219 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_110 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_220 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_110 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
