noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_295 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_295 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_296 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_296 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_297 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_297 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_99 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_197 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_99 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_198 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_99 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_298 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_298 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_299 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_299 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_300 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_300 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_100 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_199 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_100 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_200 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_100 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
