noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_85 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_85 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_86 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_86 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_87 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_87 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_29 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_57 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_29 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_58 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_29 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_88 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_88 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_89 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_89 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_90 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_90 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_30 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_59 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_30 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_60 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_30 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
