noise level: 0.5
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_301 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_301 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_302 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_302 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_303 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_303 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_101 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_201 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_101 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_202 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_101 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_304 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_304 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_305 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_305 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_306 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_306 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_102 (Flatten)        (None, 512)               0         
_________________________________________________________________
dense_203 (Dense)            (None, 500)               256500    
_________________________________________________________________
dropout_102 (Dropout)        (None, 500)               0         
_________________________________________________________________
dense_204 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_102 (Activation)  (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
