noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_145 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_145 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_146 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_146 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_147 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_147 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_49 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_97 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_49 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_98 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_49 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_148 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_148 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_149 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_149 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_150 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_150 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_50 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_99 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_50 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_100 (Dense)            (None, 10)                5010      
_________________________________________________________________
activation_50 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
