noise level: 0.5
clean data size for each class: 50
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_133 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_133 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_134 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_134 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_135 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_135 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_45 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_89 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_45 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_90 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_45 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_136 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_136 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_137 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_137 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_138 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_138 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_46 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_91 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_46 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_92 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_46 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
