noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_127 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_127 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_128 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_128 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_129 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_129 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_43 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_85 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_43 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_86 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_43 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_130 (Conv2D)          (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_130 (MaxPoolin (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_131 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_131 (MaxPoolin (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_132 (Conv2D)          (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_132 (MaxPoolin (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_44 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_87 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_44 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_88 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_44 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
