noise level: 0.8
clean data size for each class: 100
**********architecture of teacher classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_43 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_43 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_44 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_45 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_29 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_15 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_15 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
**********architecture of student classifier**********
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_46 (Conv2D)           (None, 32, 32, 32)        2432      
_________________________________________________________________
max_pooling2d_46 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 16, 16, 32)        25632     
_________________________________________________________________
max_pooling2d_47 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 8, 8, 32)          25632     
_________________________________________________________________
max_pooling2d_48 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 500)               256500    
_________________________________________________________________
dropout_16 (Dropout)         (None, 500)               0         
_________________________________________________________________
dense_32 (Dense)             (None, 10)                5010      
_________________________________________________________________
activation_16 (Activation)   (None, 10)                0         
=================================================================
Total params: 315,206
Trainable params: 315,206
Non-trainable params: 0
_________________________________________________________________
None
